[
  {
    "id": "rec1YCM7Ajj0k7Er5",
    "fields": {
      "Donor": [
        "reclIaB4KRTY0915R"
      ],
      "Date of Donation": "2019-07-18",
      "Sequence": 520,
      "Created": "2021-01-14T13:17:22.000Z",
      "ID": "LCHP--000520"
    },
    "createdTime": "2021-01-14T13:17:22.000Z"
  },
  {
    "id": "rec2GbMCg13fLjy3L",
    "fields": {
      "Donor": [
        "reclIaB4KRTY0915R"
      ],
      "Date of Donation": "2019-07-18",
      "Sequence": 523,
      "Created": "2021-01-14T13:17:24.000Z",
      "ID": "LCHP--000523"
    },
    "createdTime": "2021-01-14T13:17:24.000Z"
  },
  {
    "id": "rec4DVVTo5EXyxlmR",
    "fields": {
      "Donor": [
        "recPwH8NqmQKvhyPB"
      ],
      "Date of Donation": "2019-08-16",
      "Description": "Lakeland Jr. Sr. High School 10 Year Class Reunion Program",
      "Sequence": 521,
      "Created": "2021-01-14T13:17:23.000Z",
      "ID": "LCHP--000521"
    },
    "createdTime": "2021-01-14T13:17:23.000Z"
  },
  {
    "id": "rec4KIi63IHYCA1He",
    "fields": {
      "Donor": [
        "recQCUDbSlEDK8T1d"
      ],
      "Date of Donation": "2019-07-18",
      "Description": "Lakeland Jr. Sr. High School Souvenir Journal, created for the 2000 reunion of the Class of 1950 at First Baptist Church in Fairmont Heights, MD. Includes a forward from former class president Betty E. Marshall Queen; a section titled 'Political Greetings' with personal notes or memos from various politicians of 2000; a section called 'Class History, Class Will, Forecast 1950,' a section titled 'Teaching Staff' with a forward by Edward A. Smith; a section titled 'The Class of 1950: As We Were Then,' with yearbook-style photos; a section titled 'The Class 50 Years Later, 1950-2000' with photos/bios/updates as of 2000; a section titled 'In Loving Memory of our Teachers and Classmates' with obituaries and tributes to the deceased class members; sections titled 'Memories of our Teachers,' 'Fun Memories of Classmates at Social Functions,' 'Stories of Interest in Our Lives' (includes a list of resources for the study of black history, newspaper clippings, and Class of 1950 Newsletters), 'Historical Remembrances' with more Lakeland High School history; a class directory; list of Class of 1950 patrons; and a final section titled 'Congratulatory Advertisements.'",
      "Sequence": 508,
      "Created": "2021-01-14T13:16:53.000Z",
      "ID": "LCHP--000508"
    },
    "createdTime": "2021-01-14T13:16:53.000Z"
  },
  {
    "id": "rec5u4gacH7xjoWoQ",
    "fields": {
      "Donor": [
        "recDafv4Vl4PpM8uC"
      ],
      "Date of Donation": "2019-10-14",
      "Description": "Handwritten notes taken by Courtnie Thurston on site directly onto an inventory form.",
      "Sequence": 496,
      "Created": "2021-01-14T13:15:41.000Z",
      "ID": "LCHP--000496"
    },
    "createdTime": "2021-01-14T13:15:41.000Z"
  },
  {
    "id": "rec8cj0IQIdpatLwZ",
    "fields": {
      "Donor": [
        "recCZsOgGo3gUFsjv"
      ],
      "Date of Donation": "2019-10-20",
      "Description": "\n",
      "Sequence": 512,
      "Created": "2021-01-14T13:17:10.000Z",
      "ID": "LCHP--000512"
    },
    "createdTime": "2021-01-14T13:17:10.000Z"
  },
  {
    "id": "rec9U6MgZGGvQSjMy",
    "fields": {
      "Donor": [
        "recVmlAcNDmHZ2yOJ",
        "recuwlaMY8xGCabJU"
      ],
      "Date of Donation": "2019-10-20",
      "Description": "Item 1: Scrapbook made by donor's mother. In a photo folded up inside is pictured many women and some children seated and standing around a table. Donor's mother Gladys Lillian Haliburton(nee Essex), of Essex VA, is standing third from left. Everyone in the photo is in the Essex family. Gladys moved to Lakeland with her son, Lowell (donor), in 1944.\nOn following pages are various ephemera - sympathy cards, saved notes, thank you cards, etc. Donor's paternal grandmother's photo is on one page with various sympathy cards, and an obituary. On following pages are ephemera from a friend's wedding - cards, a kerchief, etc. \nThere are also song lyrics typed out, mostly of a religious nature. Donor went to Fermont Heights Highschool and graduated in '58. Donor's father's things. He is from WV.\nAnother wedding invitation - Bernice and Leonard Ruston - Gladys' friend, maiden name Bernice Thomas. Mary Weems' (a family friend) name appears on another card. Donor says that in the 50s, everybody in Lakeland was friends - you could \"leave the doors open and walk right in!\" \nGladys went to 1st Baptist Church and took donor to church as well - he did not like the pastor. Pastor, Dr. Covington, disrespected a member of the Weems family who was a caretaker of the church - pastor wouldn't accept his body upon his death (to be buried?). \nNext few pages are various newspaper clippings of happenings and members within the Lakeland community. \nEric Thomas, pictured in a newspaper clipping, is donor's nephew. He played football for Parkdale in the 60s/70s. \nJoanne Braxton, mentioned in another clipping, is Ms. Weems' cousin. Gladys was involved in organizing Lakeland community events. Jeff Briscoe, pictured in a newspaper clipping, is a legendary basketball player from Lakeland. He died in a house in Lakeland. Jeff went to Morgan for College. Donor played football at Fairmont Heights. Daniel Boone, pictured in newspaper clipping, was assistant director for College Park Urban Renewal Authority. He told people to sell their homes, and had a role in the getting rid of all the houses across the railroad tracks. Donor lived on Rhode island & Nahavoe in '44 with his uncle, by the streetcar stop. Donor lived on Navahoe and built a house in around '66 on the same street. Tonia went to Frederick Douglass HS.\n\nItem 2: Magazine for Gladys Hilburton - \"The Plain Truth,\" from October 1986. She was \"100% church.\" Attended \"three times on a Sunday\" and had all the kids help clean the church after.",
      "Sequence": 495,
      "Created": "2021-01-14T13:15:36.000Z",
      "ID": "LCHP--000495"
    },
    "createdTime": "2021-01-14T13:15:36.000Z"
  },
  {
    "id": "recAABZ30kWbsSNIe",
    "fields": {
      "Donor": [
        "rec7PGN7dYYhEC4I3"
      ],
      "Date of Donation": "2019-09-21",
      "Description": "Large gloss photographs (her uncle's photos) he lives in Charlotte, NC. Part stack is career-related photos of his. She thinks he was a banker, but isn't sure. Photo with congressman Nick Begich (70's). An Air Force Photo of her uncle, family photos, church photo, photo of a dinner table with her uncle as baby, photos of his daughters Lisa and Natasha. Many younger photos from the 40's, also photos from 70's and 90's. \n\nPhoto of Lakelander Myron Gray at Longfellow House Office Building greeting Congressman Nick Begich of Alaska, circa 1970-1971. Begich was also Myron's political science instructor at University of Alaska, which Myron attended in 1965 while in the Airforce; he enlisted for 49 months. Myron served as an \"unofficial aide\" of Congressman Begich saving newspaper articles of his features. Congressman Begich died in an airplane crash and was never recovered. His wife later took over his position. Woman pictured is congressional aide. \n\nMemo from Congressman Begich to Myron Gray, circa 1970-1971. \n\nPhoto of American Security and Trust Bank Staff, 15th and Pennsylvannia Ave., circa late 1970s. They evaluated bank partnerships. Myron Gray joined the banking sector after discharge from the military; he worked in the Corporate Trust Department of American Security Bank working to advance corporate trust services. The bank merged with Maryland National Bank around 1980, then merged with Nation Bank. Following the mergers, Gray's department was eliminated. (Right to left Ernie Stagnero, Myron Gray, Parker Neilson (seated), Colin ?, Peter? (last names unknown). \n\nPhoto of Airforce Unit Class on Aircraft Jet maintenence on an F-101 airplane in Amarillo, Texas, circa 1964. Gray served as an airforce mechanic for jets. This moment represented a graduation to the next level; afterward, members were sent to different bases around the country. Gray was assigned to a military base in Myrtle Beach in South Carolina between 1964-1965. Although the training group contains mixed-races, several members were from the northeast (mainly New Jersey) and \"got along pretty well because for the most part others had attended a mixed-race school.\" \n\nPhoto of training group names. A buddy jokes that \"anything is better than Amarillo\" is because the group was there in the middle of winter and surrounded by snow. Myron Gray's nickname was \"Pop\", given to him in Lakeland (by Pamela Boardley). The Gray family contains 13 children. Myron is the middle child, with 4 older sisters and 2 older brothers and 4 younger sisters and 2 younger brothers. \n\nProgram at Embry AME church in Lakeland for youth in early 1950s. Unsure of what the specific event was celebrating; possibly a \"Tom Thumb Wedding\"? Myron's sister, DeWana Gray, is pictured; she is 4 years older than Myron. Pamela Boardley, Edward Gross (Maxine's father), Manny Gray (a cousin), Regina Thomas, and Jimmy Edwards are also pictured. The Gray family was living in a family house that stood where Paint Branch is now, and then moved to a home at 8106 48th Ave., where student housing currently is. Dessie Randall Thomas usually managed youth programs at Embry.\n\nPhoto in Lakeland home (where Paint Branch Elementary School currently stands) circa 1940s or 1950s. Myron Gray's mother, Emma Christine, is in the doorway with one of the Gray children (unknown which); his aunts, Eliza and Pauline are at the table; his uncle, James Gray is standing. Left to Right: Eliza, James, Emma Christine with one of the Gray children, and Pauline Gray. \n\nGroup Family photo taken in Lakeland home (where Paint Branch Elementary now stands). Left to Right: (seated) Myron's aunt, Pauline Gray, and an unidentifiable couple. (Standing) Myron's mother, Emma Christine, Uncle Robert \"Ridgley\" (a long-time principal with school named after him in Capitol Heights), Robert's wife Mildred, Uncle Oscar, Uncle Oscar's wife Arleen, and Uncle Will.  These aunts and uncles are siblings of Myron Gray's father, Clarence Gray Sr. \n\nGroup photo, possibly taken in a school or hall circa 1950s. Front row, left to right: Uncle William Gray, Aunt Pauline Gray, Uncle Oscar Gray, Clarence Gray Sr., Uncle Robert \"Ridgley\"; Back row, left to right: friend of Uncle Jim, Uncle Jim, Cousin Ruby Edgerton.\n\nGroup photo at dedication of school honoring Robert Ridgely, circa early 2000s. Robert Ridgely served as principal of Fairmount Heights Elementary School on Addison Road from 1934- his retirement in 1970. Robert also served in the army (circa early 1940s), and was mayor of Fairmount Heights for a few years. Individuals left to right: Myron Gray, Cousin McKinley Gray and his wife Betty, Dean Matthews (son of Jean Matthews), and Kevin Harrell (grandson of Uncle Oscar). \n\nPhoto of Myron Gray's daughters: Natasha (foreground) born 1979, and Lisa (background) born 1972. Photo taken early 1980s. Neither girls ever lived in Lakeland; they grew up in Washington, D.C. \n\nPhoto of Myron Gray in the barracks in Amarillo, Texas, circa 1965. \n\nPhoto of Myron Gray, possibly in the barracks in Amarillo, Texas. \n\nChristmas photo of Myron Gray's ex-wife, Kathy, and their daughters, Lisa and Natasha, circa 1985 or 1986. Their home was near Riggs Park, in Northeast, Washington, D.C but the family moved from Northeast DC to Ellicott City in 1987. ",
      "Sequence": 528,
      "Created": "2021-01-14T13:17:30.000Z",
      "ID": "LCHP--000528"
    },
    "createdTime": "2021-01-14T13:17:30.000Z"
  },
  {
    "id": "recD2DJ151KbjJ1Pp",
    "fields": {
      "Donor": [
        "recltpOwRkNxWJup1"
      ],
      "Date of Donation": "2019-09-21",
      "Description": "Photo 1: Anderson Walls and wife Bernice, parents and grandparents of next picture. Taken in the kitchen. Maybe son's wedding, early 1980s. Lived 5118 Navahoe Street. Lived there since moving from the East Side in the 1940s. Married 1930s, Anderson b. May 4th 1912, Bernice b. August after 1914 (1916?). Mother (Anderson) moved to lakeland 1902 m. 1904. Randalls are distant relatives (cousins).\n\nPhoto 2: 3 generations- 2nd from left is Bernice Leincaster Walls. On the far right is daughter Catherine Walls Callahan, then to left are Catherine and June Lawson. Bernice married to Anderson, family came in 1902 (mother's side). Not sure when Bernice's parents came to Lakeland. There are pictures of them in the 1920s with Will and Katy Leincaster. Maybe Mother's day in the early 1990s.\n\nPhoto 3: Youngest son of Anderson, Douglas Walls, with Kathleen and June, Douglas' nieces. Photo taken around 1957/8. Douglas b. 1950. Girls b. mid-50s. All grew up in Lakeland. Girls grew up with grandparents with Douglas. Daughter built 5116 next to her parents 44 years from 2019. Used to be a croquet field in 40s and 50s. \n\nPhoto 4: Anderson and Bernice. She was an Usher at the Amory Church. Anderson died in 1993. Bernice was a lifetime church goer, but not Anderson. Anderson was a count and a Mason - 'Mason of the counts.'  Bernice was the Countess. \n\nPhoto 5: Picture of Bernice's grandmother. Photo taken in the 1900s. Katy Leincaster.\nPhotographs of Bernice and Anderson.\n\nPhoto 6: Anderson and Bernice in the kitchen in house on Navahoe Street.\n\nPhoto 7: Will Leincaster and Katy. Parents of Bernice. Smallest is Bernice (7 or 8 years old). The girl next to father is Fanny Leincaster Hill who had 14 children. Bill Leincaster is the son with Clara and Clara's daughter. To the extreme left is Katy. \n\nPhoto 8: William and Katy, Bernice's parents taken on the East side of the railroad tracks.\n\nPhoto 9: 2 generations of the girls. Middle Catherine with June and Kathleen. Circa the 90s?\n\n",
      "Sequence": 511,
      "Created": "2021-01-14T13:17:09.000Z",
      "ID": "LCHP--000511"
    },
    "createdTime": "2021-01-14T13:17:09.000Z"
  },
  {
    "id": "recEpB7Fjxxqrpoa7",
    "fields": {
      "Donor": [
        "recjE3dVPnrDCKSKU"
      ],
      "Date of Donation": "2019-09-22",
      "Description": "Clarice M. (nee Hicks) Briscoe.\nItem 1 - A photograph of Lakeland Elementary School (Upper Grades- the 4th, 5th, & 6th grades) Taken February 17, 1944. Bottom row left to right: Leon Thomas, Floyd Brown, Hurley Brooks, William \"Junebug\" Fields, Willie Lee Rita, Tommy Hill, Elwood Gross (Maxine's father); Middle row, left to right: Clarice Briscoe, Elmore Adams, Dorris Prayther, Edward Dory, Helen Prayther (Dorris's sister), Emma Dory, Mary Jackson, James Weems, Jean (Ann) Gray; Top row left to right: Catherine Walls, didn't remember, Mary Douglass, Carl Cager, Mary Hamilton, Percy Power, Margaret Anderson. Written in cursive on the back of the photo: \"The picture belong[sic] to Clarice M. Briscoe.\" \n\nItem 2 - Photograph of Retirement/Award ceremony at the Dept. of Treasury, in the Bureau of Engraving and Printing. Donor worked as accounting receiver. She is in the back row second from the left. \n\nItem 3 - Group photo of a group of women and one man on far left. Two flags are in the background. Taken when she was a union member and member of the EEOC committee in 1972, while she was still working at Dept. of Treasury. Ms. Briscoe is second from the left. Written on the back are the names of people in the photograph, as well as the date of 1972.\n\nFourth item- Retirement testimonials for donor from the Bureau of Engraving and Printing. On the document are the date she was appointed, March 13, 1967, and the date she retired, on March 31, 1995. \"We your co-workers during the past years, have enjoyed your companionship and your genial personality. We shall always cherish the memories of your association and friendship. We extend this testimonial as a wish that your retirement may bring good health and happiness which you so justly merit after years of faithful service.\" Her coworkers signed the document with notes wishing her well. \n\nItem 5 - Photograph from donor's recognition ceremony of her 25 years of service at the Bureau of Engraving and Printing; writing on the back reads \"25 years - Clarice Briscoe, Director Peter Daley\" \n\nItem 6 - Graduating Class meeting program- 1950 Graduating Class. From a recent reunion on July 18, 2019. She was a part of the first 12th grade to graduate from Lakeland High School.",
      "Sequence": 497,
      "Created": "2021-01-14T13:15:43.000Z",
      "ID": "LCHP--000497"
    },
    "createdTime": "2021-01-14T13:15:43.000Z"
  },
  {
    "id": "recGe5sxO5fuc35iv",
    "fields": {
      "Donor": [
        "recPwH8NqmQKvhyPB"
      ],
      "Date of Donation": "2019-09-14",
      "Description": "Lakeland High School 1950 Graduating class (Lakeland junior/senior high school) materials:\n\n- Class reunion brochure: 40th reunion (June 22-24, 1990) at First Baptist Church in Fairmont Heights, MD, The Ramada Inn in Lanham, MD and Chittman's Ball Park in Bowie MD for 3 days. Chittman's Ball Park was where Bowie High School's baseball team played. Program lists 23-24 communities involved, represents all the communities of Lakeland High School students. \"1931 it all began here\" is significant because most of the class was born that year; \nmany were born at Freedman's Hospital or by mid-wife. Some classmates attended the closing ceremony for the closing of Freedman's Hospital. Almost all started elementary school in the 1938-1939 school year.  The community hosted trips to Sparrows Beach, field trips into Washington, D.C. on the trolley, and \"Lawn parties\" were hosted to sell food and drinks. Students came over from Highland Park and other schools. Mrs. Denson served as the guidance counsellor at Lakeland High School and made a significant impact in ensuring students were supported. Letter from the steering committee June 1990 was mostly comprised of Bettye Queen and Edda Marshall. Harrison Thomas and Elsie Carter were top of the class and recognized with \"first honors.\" Organizers were deeply involved in their respective churches, from Sunday school to ushering. Edda was Catholic; Inez-Snowden was a \"devoted person to her religion\" and served as a docent for one of the oldest churches in Prince George's County in Glendale (off of Greenbelt Rd.) The band who played at the event was Valiants. In high school during the winter, physical education classes focused on dancing; they learned the waltz and the two-step. Joseph Barber and Ivan James loved to dance and were the best; Arthur Dock loved the jitterbug.  Program also includes: toast from Edda Marshall; musical performances from Brudell Mary Jones, Odell Elizabeth Scott; \"In Memorial\" section for classmates/teachers, Worship Service schedule, led by Rev. Rodney Young. The Lomax gospel singers were paid to preform. Guest Pastor Tyrone Queen, the nephew of Bettye and Jake Queen, let the sermon.  Joseph Barber is listed in those who passed in 1990; Mr. Marvin Henry is also listed and was the husband of classmate Helen Henry, he was robbed buying a boombox; Mrs. Emma Dory Powers, who's father was the Head Chef of University of Maryland's Cafeteria, passed away after she married; Mr. Norman Tillman \"was very bright but very quiet\"; Mr. Charles Thomas, of Muirkirk, was in military and eventually moved to Texas. Weekend activities, organized by Bettye Queen and Rodney Young, included memorial worship service dinner dance at grand ballroom, baseball game at chittams ball park. Steering Committee: James Chittams, Dolores Bervard, Arthur Dock, Helen Duvall, Vera Johnson, Edda Marshall, Delores Prince, Bettye Queen, Beatrice Snowden, William Wright, and Rodney Young. Also included is history of Lakeland Junior Senior High School and message from the teaching staff (Mr and Mrs. Jefferies the science teachers and monitor of the photography club, Coach Thomas the P.E teacher, and Mr. Pinkett the music teacher). Mr. Pinkett eventually left to teach in his hometown on the eastern shore of Maryland. \"We had good teachers, and I used that all the way through school.\" They learned the school's history from others; Mr. Docks sister, Pauline Hill, went to Lakeland High School Class of 1931, and his brother attended for a bit, but dropped out to join the Navy. Many classmates also had parents who were alumni. \"The students and community had respect for the teachers. You knew your limits.\"\n\n- 2 Invitations (with two envelopes: 1 addressed to Mr. Dock, one blank) for the announcement of the 40th Class reunion dinner/dance at the Ramada Inn (June 15 1990) -- two different dates. Envelopes are addressed in Mrs. Bettye Queen's handwriting. ",
      "Sequence": 527,
      "Created": "2021-01-14T13:17:29.000Z",
      "ID": "LCHP--000527"
    },
    "createdTime": "2021-01-14T13:17:29.000Z"
  },
  {
    "id": "recHXUGo1qdxl4IUV",
    "fields": {
      "Donor": [
        "rec5eOUiXhYUXwMh3"
      ],
      "Date of Donation": "2019-06-29",
      "Sequence": 502,
      "Created": "2021-01-14T13:16:03.000Z",
      "ID": "LCHP--000502"
    },
    "createdTime": "2021-01-14T13:16:03.000Z"
  },
  {
    "id": "recIGsmRfOxeTYXkI",
    "fields": {
      "Donor": [
        "recPwH8NqmQKvhyPB"
      ],
      "Date of Donation": "2019-09-14",
      "Description": "Program of junior/senior high school class reunion of 1950. (Reunion in 1986.) Held in Temple Hills. People went to Temple Hills skating rink afterwards. ",
      "Sequence": 522,
      "Created": "2021-01-14T13:17:23.000Z",
      "ID": "LCHP--000522"
    },
    "createdTime": "2021-01-14T13:17:23.000Z"
  },
  {
    "id": "recIJ3vBpFlKJ0QXU",
    "fields": {
      "Donor": [
        "recUoeggJvFojP7vl"
      ],
      "Date of Donation": "2019-10-20",
      "Sequence": 500,
      "Created": "2021-01-14T13:15:50.000Z",
      "ID": "LCHP--000500"
    },
    "createdTime": "2021-01-14T13:15:50.000Z"
  },
  {
    "id": "recIXbmVXH25RuBhq",
    "fields": {
      "Donor": [
        "recvTUkidVK0wGAOI"
      ],
      "Date of Donation": "2019-10-20",
      "Description": "The pins: Her mom's pins that were received from Maryland public school. The pins might've been received as her mother moved from one grade to another. She believes that one might be for passing the 10th grade, 11th and 12th. \n\nChange purse: found it in her mother's belongings in a chest in around 1967. Filled with coins that aren't as old as the purse. One coin is dated 1979, another is a liberty dollar - there are also two dimes and a nickel. \n\nThe ring: Donor's mother's high school class ring - from Lakeland High School. The mother's name is Agnes S. Randall, nee Ross. She graduated in 1939. \n\n\nHer mother passed away Jan 23 2019.\nShe's keeping the items in a safe space. Might give the ring to one of her grand kids.",
      "Sequence": 516,
      "Created": "2021-01-14T13:17:18.000Z",
      "ID": "LCHP--000516"
    },
    "createdTime": "2021-01-14T13:17:18.000Z"
  },
  {
    "id": "recJIvXhGiMVTzneX",
    "fields": {
      "Donor": [
        "recUoeggJvFojP7vl"
      ],
      "Date of Donation": "2019-10-20",
      "Sequence": 501,
      "Created": "2021-01-14T13:15:58.000Z",
      "ID": "LCHP--000501"
    },
    "createdTime": "2021-01-14T13:15:58.000Z"
  },
  {
    "id": "recJu9D9b3r2hKh0d",
    "fields": {
      "Donor": [
        "recshzyYADXubfvzq",
        "recvdXjWZtf1nLxTk"
      ],
      "Date of Donation": "2019-09-21",
      "Description": "James Edward Campbell III and Pearl Lee Campbell Edwards (husband and wife, grew up together, born same year, christened in same church.) \nCollection of 4x6 color glossy photos of 50th (2014) wedding anniversary celebration: of the cake, original wedding topper '64, photo of pastor Edna Canty Jenkins at Rosewood Manor,  wedding rings (some rings were heirloom rings) and bracelets (from every place they visited, such as Hawaii, Alaska etc).\n\nPhoto of her daughter who was from Lakeland; \nmany attendants of their celebrations - childhood friends who left and returned; many multi-generational family members like cousins and parents - some who have attended Lakeland schools/still live here. \nHoward Studios was the studio they both took their baby photos in the same year in the same room. Also brought in larger decorative photo albums. \n",
      "Sequence": 489,
      "Created": "2021-01-14T13:15:19.000Z",
      "ID": "LCHP--000489"
    },
    "createdTime": "2021-01-14T13:15:19.000Z"
  },
  {
    "id": "recLPwxkigfB1r8Ag",
    "fields": {
      "Donor": [
        "recSa8uT8dsCEQSpM"
      ],
      "Date of Donation": "2019-09-21",
      "Description": "Photo 1: Taken in 1946, Irene Helen Smith holding first nephew (Leo Johnson), donor's cousin, on her lap. Donor's mother (Irene Helen Smith, née Irene Russell), was physically born (with a midwife!) in 1928 and raised in Lakeland. She attended Lakeland High School.\n\nPhoto 2: Irene Helen Smith in photo studio (potentially in DC or Baltimore), with palm tree painted backdrop, estimated to be taken in 1946. \n\nPhoto 3: Donor's mother and father (Robert Lee Smith), married about 1949. Photo taken in 1953 or 1954 in DC - they'd moved to DC after marrying. Donor's father was in WWII, stationed in Pacific. Maybe Guam?\n\nPhoto 4: Studio portrait of Irene Helen Smith shortly after marriage. \n\nPhoto 5: Donor's mother and father celebrating their 50th wedding anniversary, with cousin Isaiah Johnson, in early 2000s, at a restaurant in PG County. Isaiah is hugging donor's father from behind. Donor's mother attended and brought her children to St. Paul's Baptist Church when living in DC.\n\nItem 6: (PHOTO ALBUM):  First page Front: Donor and his oldest son (Derrick N. Smith), born in 1975. \nBack: Christening of Derrick Smith, at an Episcopal Church in downtown DC, with Godfather (Donor's first cousin & fellow Lakelander) Raynard Johnson and Godmother, and donor's wife Virginia C. Smith. \nSecond page front: Derrick Smith in backyard of donor's mother's house in northeast DC. They could take streetcar to Lakeland from DC to visit family in those days.\nBack: More Derrick Smith pictures. \nThird, Fourth, Fifth pages: More Derrick Smith pictures. Derrick had a toy poodle he loved, named Presley. They moved to Forestville District Heights in PG county after leaving DC. Fifth page has Derrick with donor's sister Vanessa Helen Smith and his mother Irene Helen Smith. \nSixth page: Derrick Smith, Robert Lee Smith, donor, and Vanessa Smith. \nSeventh page: Derrick Smith, donor's brother Emanuel Smith, and donor's sister-in-law Ella Smith, at Christmas, late 1970s. Also pictured is Emanuel's daughter Adrienne (Donor not sure about spelling.)\nBack: Ebony Kay Smith (donor's daughter)b. 1980. Pictured with Derrick Smith. \nEighth Page: Virginia Smith with Derrick Smith, and Vanessa Smith at prom. Vanessa attended Mckinley Tech High School, as did donor. \nBack: Donor's aunt Annie May. \nRest of album: Nephew (Kristopher Smith), Niece (Adrienne), Aunt (Lelianae Johnson) mother of Maggie Johnson. Photos of relatives from various birthdays. Sister Vanessa's graduation photos. Photos from family vacations.\nDonor's father Robert Lee Smith was hit by car and broke his leg - picture of him during recovery. ",
      "Sequence": 492,
      "Created": "2021-01-14T13:15:22.000Z",
      "ID": "LCHP--000492"
    },
    "createdTime": "2021-01-14T13:15:22.000Z"
  },
  {
    "id": "recM0Fsal61OzPXK3",
    "fields": {
      "Donor": [
        "recA4NS25N25W1yl1"
      ],
      "Date of Donation": "2019-09-21",
      "Description": "Some personal records: Birth certificate of herself and her husband, son's birth certificate (born in D.C.) marriage certificate to Samuel the 1st (married in 1995) when she lived in Lakeland she lived on Rhode Island Ave. \n\nSeries of small glossy photographs (family photos of  cousins/siblings/parents): great grandmother as kids (Alberta) and great aunts (Geraldine, Laverne, Eleanor, Dorothy) at a birthday party, her siblings at Easter, photo of her father in 60's, grandmother's porch and cousins (grandmother's porch was gathering place for them,) Tom Thumb (a mock children's) wedding in 1959, American Legion band (and a parade) with her siblings.",
      "Sequence": 525,
      "Created": "2021-01-14T13:17:27.000Z",
      "ID": "LCHP--000525"
    },
    "createdTime": "2021-01-14T13:17:27.000Z"
  },
  {
    "id": "recMA6oes6we4I1Pz",
    "fields": {
      "Donor": [
        "recuwlaMY8xGCabJU",
        "recVmlAcNDmHZ2yOJ"
      ],
      "Date of Donation": "2019-10-20",
      "Description": "5971a8-001: School photo of Lowell's cousin Wanda Essex from Baltimore. She had two brothers. \n5971a8-002: Syble Essex's (donor's cousin) note written to Gladys. \n5971a8-003: Moses Haliburton(nephew from brother) and his daughter Briana. They still live in VA.\n5971a8-004 is the back of the photo, with a note written on it.\n5971a8-005: James Randolph Haliburton's (donor's oldest brother) daughter Jennifer. Lowell was the youngest of 5. James lives in Hamilton, North Carolina now.\n5971a8-006: Back of previous photo. Reads: \"To Grandma Gladys, Sorry I couldn't make it this summer. Hopefully I'll see you this winter. Love ya, your granddaughter, Jennifer G.\"\n5971a8-009: Lowell's niece Jennifer (aka Jiji), Ariel and her husband. Living in NC. Ariel Haliburton is deceased. Ariel kept the Haliburton name.\n5971a8-010: Picture of an award ceremony in 1984.\n5971a8-012: Senior photo of Vanessa Wilson, born and raised in Lakeland, and lived on Navahoe Street. Lived across from donor in what used to be the Gipson's house. Left in the 70s.\n5971a8-014: Picture of interior of First Baptist Church.\n5971a8-015: Photo of donor's sister's (Osceola) daughter (Osceola), with her date likely before prom. Named after famous leader of Seminole peoples, Osceola. Essex family has Native American heritage.\n5971a8-021: Strawberry Shortcake Valentine's day card from donor's niece, Robin.\n5971a8-024: Thank you cards from beautician Gertrude Corporal, who used to babysit Lowell.\n\nVarious childhood/youth photos of Osceola and Wanda.",
      "Sequence": 504,
      "Created": "2021-01-14T13:16:44.000Z",
      "ID": "LCHP--000504"
    },
    "createdTime": "2021-01-14T13:16:44.000Z"
  },
  {
    "id": "recNuHLjKZbF2dUHw",
    "fields": {
      "Donor": [
        "recshzyYADXubfvzq",
        "recvdXjWZtf1nLxTk"
      ],
      "Date of Donation": "2019-09-21",
      "Description": "Photo 1: James Walter Edwards III, and Pearl Lee Campbell taken in June 1962, taken for Prom at Fairmont Heights.\n\nPhoto 2: Pearl Lee Campbell Edwards and James Walter Edwards at daughters wedding in 1987 at Embry Ame Church.\n\nItem 3: High School yearbook for class of 1962 Fairmont Heights High School. Senior year of James Walter Edwards and Pearl Lee Campbell. In the back of the book she has pasted clippings of obituaries from staff or students who were working at/graduated from the school in 1962. \n\nItem 4: A scrapbook dating from June 1969-1979. Mainly newspaper clippings (obituaries, articles), birthday cards, letter to parents of Lakeland Elementary School children (Pearl Lee Campbell Edwards was a parent of a student), a presentation by Pearl Lee to get Paint Branch built.  Newspaper clippings of popular tv program hosts obituaries, events happening in Lakeland community (ex., 'first demolition in Lakeland', 'Lakeland Urban Renewal Project'), response to letter on desegregation plan, editorial on 'Saving Lakeland.'\nStained Glass with Wedding Certificate. Amory Church. Pastor was Reverend Beatty. Married 55 years. \n\nItem 5:  A photo album.\nChildren of Pearl. Oldest daughter Monica, Deneem Turner, Grandma Elizabeth. Elizabeth's house in Lakeland. James Walter Edwards IV. Monica b. 1964. James IV 1968. Monica standing in front of a pine tree her grandfather planted. Monica at her 4th birthday with friends from the Lakeland area. Monica went to Lakeland Elementary and then Paint Branch. Photos throughout the elementary school years. Moved away from Lakeland. Lakeland elementary from 68 and went to Samuel Morris in 73. Monica's Baptismal Certificate done by Rev. RH Batty. Pictures of (Lil) Jimmy (b. 1968) growing up from a toddler. Aunt Cathleen and Uncle James' (Tyrone) Wedding (1972). Cousins lived on both sides of the Edwards.  Lil Jimmy's baptismal certificate. James V is Pearl's grandson. Picture of Pearl in 1968 pregnant with Jimmy. Lil Jimmy never cried as a newborn. More baby pictures of Monica and Lil Jimmy. Baby Jimmy in his christening outfit on Dec. 27 1968 (Day of Pearl's Father's birthday). Picture of an outing at Patapsco State Park. Was one of the few areas that segregation allowed. Picture of Easter Sunday at Pearls Mom's house. Picture of James Walter Edwards II, IV, Monica. James' parents moved to Lakeland in 1940. Went to be near to sister who was already in Lakeland. The Campbells moved to Lakeland to be with one sister. Pearl's uncles each had nicknames like Cheif and Street Rod.\nLeady Edwards Hamlett was James' sister. Family photo, dated 1982. Monica was in 12th grade and Jimmy in 8th grade. Official family photo of James III, James IV, Monica Deneem Edwards, and Pearl. University of Maryland had a 5 mile radius where they could not get a home.\n\nItem 6: A bouquet. Jennifer Campbell Dawkins gave her this woven bouquet on a recent trip. It's a token of sisterly love. \n\nItem 7: 50th anniversary bouquet made in Charleston to commemorate heritage from that area. Weaving of these bouquets and other grass-woven items is a tradition in South Carolina. \n\nItem 8: Washington Post: Article in the Post Pearl's daughter sent information for. An article on Pearl and James on their 50th anniversary. \n\nItem 9: Mother's bowl: Buffalo pottery done in the early 1900s. Bowl has been passed down through many generations. Currently belongs to Pearl's granddaughter.",
      "Sequence": 517,
      "Created": "2021-01-14T13:17:19.000Z",
      "ID": "LCHP--000517"
    },
    "createdTime": "2021-01-14T13:17:19.000Z"
  },
  {
    "id": "recPYtfbzuKfaGt7h",
    "fields": {
      "Donor": [
        "recbGpQvn4uyH8FkQ"
      ],
      "Date of Donation": "2019-09-22",
      "Description": "Item 1 - The Dory Family Reunion family tree. Ethel Lockerman's father's name was Delarce Dory known as Lock boy, he worked at the University of Maryland for 52 years. He started out as a cook. Ethel L.'s great grandfather would take Lock boy to work at 13. He made 75 cents a day. The family reunion was held at the Vansville Community Center in Beltsville Md. Delarce Dory only had about a third or fourth grade education.\n\nDelarce Dory lived on Navahoe Street. The house just sold to University of Maryland. \n\nItem 2 - Family marriages list starting with great grandfather Charles E. Dory married ___ in 1898\n\nItem 3 - Newspaper clipping of Frank Dory, recognized for third generation of the family continuing to work at the UMD dining hall. Curtis Lockerman soon carried legacy. \n\nItem 4 - Newsletter. Newsletter features Curtis Lockerman (son of Ethel Lockerman) who worked at the warehouse on campus. Taking food inventory.\n\nItem 5 - A candy bag: The University of Maryland opened a \"sweet shop\" named it on behalf of Delarce Dory. He operated \"Dory's Sweet Shop.\" He also managed the dining hall at the university.   \n\nItem 6 - Photograph c. 1962 of Dessie Thomas, sunday school teacher and her pupils. She was a government employee but taught sunday school.\n\nItem 7 - Photograph of Delarce Dory. Delarce was a Mason. Taken at the Mason lodge, where they had their meetings. \n\nItem 8 - Photograph of male members of Embry AME taken outside of , Chesley Mac, Mac Allen, Rev. Mosley, Ben Bristow, Arthur Brooks, Delarce Dory.",
      "Sequence": 506,
      "Created": "2021-01-14T13:16:48.000Z",
      "ID": "LCHP--000506"
    },
    "createdTime": "2021-01-14T13:16:48.000Z"
  },
  {
    "id": "recPdumO9TLDBQUrt",
    "fields": {
      "Donor": [
        "recPwH8NqmQKvhyPB"
      ],
      "Date of Donation": "2019-08-31",
      "Description": "Souvenir Journal, a yearbook from the 35th Class Reunion (June 14-15, 1985) at First Baptist Church in College Park, Md and the Ramada Inn in Lanham, Md. Edgar Smith put this together for us. It has a few letters and a set of senior superlatives and the yearbook photos of each student. The next item is the program for the 35th Class Reunion. Then there are a series of photographs of one particular party--the reunion. 14 photos. Also an inventory list for the 3 items.",
      "Sequence": 514,
      "Created": "2021-01-14T13:17:15.000Z",
      "ID": "LCHP--000514"
    },
    "createdTime": "2021-01-14T13:17:15.000Z"
  },
  {
    "id": "recRPKxfMRNKDmNJZ",
    "fields": {
      "Donor": [
        "recPwH8NqmQKvhyPB"
      ],
      "Date of Donation": "2019-08-16",
      "Description": "Lakeland High School Flyer Trip Announcement, October 12, 1990 held at St. Joseph's Catholic Church. Scholarship offered by the last class to provide funds to Fairmont Heights students in honor of principal, Edgar A. Smith. Each season they hosted a fundraising event (Sparrows beach in summer, dance/festival in Glenarden in the fall, Atlantic City trips); James Chittmans designed the flyer; Vera Johnson and Bell Wright acted as organizers. \n\nLakeland High School Reunion Trip Flyer to Las Vegas in 1991. The class flew from BWI airport and stopped in Missouri to see the Gateway Arches. More than 100 individuals attended, including spouses and children; many of the classmate's families sponsored their trip. They toured Gladys Knights' home and the home of Sanford & Son, and gambling and a helicopter rides. The whole class had a hand in organizing the trip. \n\nEdgar A. Smith Scholarship document; typed on a typewriter; scholarship established before invention of computers. The scholarship was organized by Lakeland High school last class, but they wanted to include other schools. They traveled to Upper Marlboro Legal Library to research and structure the scholarship, eventually getting it incorporated. Each year, the committee reviewed applications with the goal to distribute $2,000 to high school students for college costs; recipients were from the towns of Fairmont Heights, Bowie, Laurel, and Muirkirk. School desegregation impacted the group of recipients. \n\nEdgar A. Smith Scholarship Application used to vet applications. Individuals from the last class served on sub-committees for the creation of application and to reviewers of applications. \n\n\"Jake\" Sterling Queen was the individual driving force and organizer for the Edgar A. Smith Scholarship. He became Mrs. Bettye Queen's wife and had younger sisters who attended Fairmont Heights. \n\nEvaluation for Screening Scholarship Applicants. Requests information on test scores, community involvement. Mr. Dock says many students were most involved in local churches (many from First Baptist Church in Glenarden). First Baptist Church of Glenarden was heavily involved in student programming. After 1950, the County reorganized the curriculum to stress business and vocational skills (shorthand, typing, bookkeeping, brick laying, carpeting). Lakeland High School Class of 1950 and Frederick Douglass HS had the first 12th grade classes in the County; prior to that students graduated in 11th grade. Central Avenue served as dividing line. One scholarship recipient became a Pharmacist after graduating from Howard University School of Pharmacy; One went into nursing, one pursued ministry, some became teachers in Prince George's, Howard County, or Baltimore City. Many males went into the Air Force.  ",
      "Sequence": 491,
      "Created": "2021-01-14T13:15:21.000Z",
      "ID": "LCHP--000491"
    },
    "createdTime": "2021-01-14T13:15:21.000Z"
  },
  {
    "id": "recSkk0DOoqHW9BK8",
    "fields": {
      "Donor": [
        "reclIaB4KRTY0915R"
      ],
      "Date of Donation": "2019-07-18",
      "Sequence": 515,
      "Created": "2021-01-14T13:17:17.000Z",
      "ID": "LCHP--000515"
    },
    "createdTime": "2021-01-14T13:17:17.000Z"
  },
  {
    "id": "recUmKe6UOoas2B10",
    "fields": {
      "Donor": [
        "recPwH8NqmQKvhyPB"
      ],
      "Date of Donation": "2019-09-14",
      "Description": "Collection of documents of Lakeland High Class of 1950. Includes memorial service invitation 2000; memorial service program 1996.\n\nAnnouncement for Memorial Service on May 25, 2000 at First Baptist Church of Fairmont Heights. Reverend Mines led the service. The class convened every 5-10 years to celebrate classmates and teachers from Lakeland High School who passed away. The class set aside a month to honor them at a local churches in Fairmont Heights and Glenarden. The names of those passed were read and then a bel was rung. Rev. Rodney L. Young would often recruit the guest speakers. Family members of those passed were also in attendance. \n\nAnnouncement for Memorial Worship Service at First Baptist Church of Glenarden June 27 1990. The guest preacher was Rev. Tyrone Queen, head of Oakland Baptist Church and the nephew of Jake and Bettye Queen. The Lomax Gospel Singers of Chapel United Methodist Church in Laurel sang; Dolores Lomax was a part of the group and a classmate of the last class. The classmates being honored who died: Emma Dory Powers, lived in Lakeland and attended Maryland State Teacher's College at Bowie; Tillman, worked with the federal government; Marvin Henry; Charles A. Thomas, had a large family in Muirkirk, went into the military, was a good hunter, and played sports; Malachi Hunter, was the best dancer among males in the class, was a \"rascal\" and altar boy. Teachers listed: Edgar A. Smith, Lakeland High School Principal \"he wanted the best for you\", taught algebra; Mrs. Myrtle M. Fentress \"was a real leader who wanted the best for us,\" \"if we ever needed anything, she was there\", taught history and led the Glee Club, was found in her apartment after suffering blood pressure problems; Mrs. Vivian M. Ford, taught English to ninth graders only; Mrs. Marie Owens Halls was \"mean\" and soft-spoken, she wrote her day's objective on the board, \"she was an excellent teacher\" and a Prince Georgian. She went to Douglass and went to Howard, she was eventually afforded an opportunity to go to NYU for her Masters since Blacks weren't allowed to attend Maryland University. Bettye and Jake Queen, Bill Wright, Etta Marshall were organizers; their homes were also meeting houses for the last class. \"We always supported each other. if someone passed, or was ill, we'd coordinate to send flowers or a card to the family.\" Delores Barrows Berdeves, a classmate, wrote the poem on back (passed Oct 2019 in Fairmont Heights). Lakeland High School english teachers, who largely came from Morgan State or Hampton, stressed poetry reading. \n\n",
      "Sequence": 518,
      "Created": "2021-01-14T13:17:20.000Z",
      "ID": "LCHP--000518"
    },
    "createdTime": "2021-01-14T13:17:20.000Z"
  },
  {
    "id": "recgb5JvmztyDNBCX",
    "fields": {
      "Donor": [
        "recOXj2kENoQ2pujV"
      ],
      "Date of Donation": "2019-09-21",
      "Description": "NOTE-Only able to digitize the first 191 pages on 9/21, may want to schedule a follow-up for remaining pages.\n\nItem is a barber book - has her Lakeland home address on the inside. The book is at least 48 years old. She's maintained her barber license ever since - she's a master barber. She professionally cut hair for about 10 years('71 to about '82), before working for the federal gov't. She worked at the Glen Arden barbershop, with mostly Glen Arden clientele. After, she worked at Sis's Barbershop. She took the barber test in Wheaton with Freddy McCoy, her godfather. Was inspired to cut hair by watching Wallace Potts. She would also cut hair of homeless men when she was experimenting/learning . Mrs. Williams lived in Lakeland until she moved out in about '79. ",
      "Sequence": 526,
      "Created": "2021-01-14T13:17:28.000Z",
      "ID": "LCHP--000526"
    },
    "createdTime": "2021-01-14T13:17:28.000Z"
  },
  {
    "id": "recgrK2CIypOGNT3O",
    "fields": {
      "Donor": [
        "recCZsOgGo3gUFsjv"
      ],
      "Date of Donation": "2019-09-17",
      "Description": "Formal program for Lakeland Heritage Weekend September 2018. This consisted of the dream team basketball game (Sept 14) at the College Park Community Center. The second part was the Great Lakeland Parade and Picnic at Lakeland Park (Sept 22). Special guests were Leonard Smith (Grand Marshal), the Fairmont Heights High School Marching Band and the Chang Band. The third part was a gospel concert at Washington Braizilian SDA Church (Sept 23) with various highlighted performers.",
      "Sequence": 490,
      "Created": "2021-01-14T13:15:20.000Z",
      "ID": "LCHP--000490"
    },
    "createdTime": "2021-01-14T13:15:20.000Z"
  },
  {
    "id": "recguFK75PzVRVDb0",
    "fields": {
      "Donor": [
        "recPwH8NqmQKvhyPB"
      ],
      "Date of Donation": "2020-01-14",
      "Description": "Betty Marshall's high school diploma.\n\nYearbook of Lakeland Junior-Senior High School's graduating 1950 class.\n\nBetty Marshall's report card for the 1949-1950 school year.\n\nA booklet for the commencement of the class of 1950.\n\nA letter to parents of graduating students notifying them of the schedule of closing activities for the school year.\n\nA pamphlet for the 35th class reunion of Lakeland's class of 1950.\n\nA pamphlet for the \"Because We Care\" 46th reunion.",
      "Sequence": 503,
      "Created": "2021-01-14T13:16:20.000Z",
      "ID": "LCHP--000503"
    },
    "createdTime": "2021-01-14T13:16:20.000Z"
  },
  {
    "id": "reck9ADjuES3gSagL",
    "fields": {
      "Donor": [
        "recPwH8NqmQKvhyPB"
      ],
      "Date of Donation": "2019-08-15",
      "Description": "Folder includes Class Newsletters, Stationary Letterhead, and Meeting Minutes. \n\nSave the Date Flyer for \"Because We Care\" Reunion, December 7, 1996. Teachers were in attendance. Jake and Bettye Queen were organizers for the event; their home was used as the address 1422 5th Street Glenarden, Maryland. \n\nClass Newsletter from October 1996 includes President's Message from William Wright. William Wright was a Lakeland High School classmate and President; like Jake and Bettye Queen, he was instrumental in organizing events. Secretary Edda Marshall was \"a bundle of fun\" and \"an excellent teacher [in Prince George's County]. She taught special education. She kept excellent notes... she could always go back and reflect on what we were thinking.\" Her husband, Michael Marshall, wasn't a part of the last class but was very involved with her because they lived in Fairmont Heights. Treasury Report Helen Prather-Duvall was an \"excellent person with the finances.\" Dolores Burrow-Brevard was also instrumental in helping. Officers are listed on the front, scholarship recipients are listed in the centerfold. Arthur Dock was parliamentarian, in charge of ensuring the guidelines were being followed. Rev. Rodney L Young was chapman. Page 3 has a note from the Health & Welfare Committee, Reader Spotlight. Newsletters were distributed every 6 months; Bettye Queen and Edda Marshall was mainly in charge.\n\nEdgar A Smith Scholarship Application copy. Edgar A. Smith had a son and daughter. James Chittams wanted to design a book on him, but didn't get cooperation from the family.  \n\nLakeland Newsletter, winter edition (no year listed, possibly 1991). Includes a letter for the president mentioning the Las Vegas trip, information about the scholarship. Betty and Sterling Queen are listed as contact people. Final page announces Winter Dance on Dec 1 1991 at the residence of Mr and Mrs. William Wright in Glenarden. Quarterly meetings listed for follow-ups/recap of trips; to add an item to the meeting agenda, classmates called Jake Queen or the President. \n\nLetterhead from Lakeland High School. Rodney Young designed the letterhead and wanted to \"keep it simple.\" The lamp of knowledge served as a symbol for the last class. \n\nMeeting Minutes from Dec 17, 1999; penned in Mrs. Bettye Queen's penmanship. \"Whatever she did she did well, she was a great leader.\" Agenda items include treasurer report  and scholarship report. Lists January 8 as 50th year in ministry; church on Wheeler Road. More than half the class went to a hotel in Oxen Hill to celebrate. Dues were collected from classmates to fund activities; advertisements were also placed in local newspapers to promote the last class' activities. Glenarden, Laurel, and Lakeland all had strong American Legion chapters and were avid advertising partnership. Lakeland Hall on Rhode Island Ave. housed Lakeland's American Legion Chapter and the House of Ruth, a religious organization. They used to hold poetry recitals for youth, because \"poetry makes you think.\" Spiritual hymns were also vital.",
      "Sequence": 507,
      "Created": "2021-01-14T13:16:49.000Z",
      "ID": "LCHP--000507"
    },
    "createdTime": "2021-01-14T13:16:49.000Z"
  },
  {
    "id": "reckfcADKOhmC6IK2",
    "fields": {
      "Donor": [
        "rec5FbbNnpXaGQUXI"
      ],
      "Date of Donation": "2019-09-21",
      "Description": "Guy Weems, Direct descendent of Mary Weems, father was James Weems. Lawrence Johnson Weems. \nPhoto 1:   Taken at Gary Weems's 1987 wedding. Pictured are the four brothers, the children of James and Dolores. Gary in center, on the right are Guy and Michael, and on the left are Glenn and Luther. \nPhoto 2: Guy and Mother Dolores.\nPhoto 3: Dolores Johnson Weems. Taken in 80s-90s.\nPhoto 4: Dr. Joanne Broxton. Aunt of Guy sister of James. b. May 1950. Retired Professor of William and Mary. The first black tenured professor.\nPhoto 5: Joanne with daughter. Graduation from Duke. May 2010 now phD candidate at Harvard for Japanese art history. \nPhoto 6: Roy Few. Descendant of John Johnson, with Sarah Weems barber and Daughter Betty. Roy passed in 2015 at around age of 50. \nPhoto 7: Middle is Tommy Oldberg, erlene's brother. Jerry McMillian and jerry mason. and Guy on the bottom. Taken when they were in their 20s. Played a lot of sports. \nPhoto 8: Guy with Carol Taylor on his left, descendant of John Johnson through Ruth Leincaster, she had one son Charles Llewyn Taylor. They grew up in Philidelphia. \nPhoto 9: Guy in the middle, Mike Middleton (married to Sandy hills granddaughter). Darnette Fields.\nPhoto 10: James (Billy) Weems's three sons. Pictured are Guy, Michael, and Glenn. \nPhoto 11: Billy's casket in 1980.\nPhoto 12: Bill's wife with all of her children. Cloclwise starting from left & going up/around - Michael, Glenn, Luther, Gary, Marsha, Guy. \nPhoto 13: Top is Guy and Dolores (not in Lakeland). Dolores moved to the district after divorce. Dolores went to Lakeland High. 1986. ",
      "Sequence": 493,
      "Created": "2021-01-14T13:15:24.000Z",
      "ID": "LCHP--000493"
    },
    "createdTime": "2021-01-14T13:15:24.000Z"
  },
  {
    "id": "recmYtPgIwKXUmG6g",
    "fields": {
      "Donor": [
        "rec0yxq24ElQGnI3Y"
      ],
      "Date of Donation": "2019-09-21",
      "Description": "Old metal plate portrait of Mrs. Gross's great grandmother, born in 190- (first decade of 1900s). Emma Harrison. Not a Lakelander - originally from Murkirk MD. Moved to Lakeland when she married donor's great grandfather in the 1920s, who worked at the ironworks in Murkirk. Metal plate could be a photograph that's been painted over to add color and detail. ",
      "Sequence": 505,
      "Created": "2021-01-14T13:16:47.000Z",
      "ID": "LCHP--000505"
    },
    "createdTime": "2021-01-14T13:16:47.000Z"
  },
  {
    "id": "recoesHvigzhBmbs1",
    "fields": {
      "Donor": [
        "recVmlAcNDmHZ2yOJ",
        "recuwlaMY8xGCabJU"
      ],
      "Date of Donation": "2019-10-20",
      "Description": "These are ordered as they were shown in accession video.\na649c8-005: School photo of Moses Carry Haliburton Jr. (nephew on brother's side) a Lakeland native, around 11 years old in the picture. He moved to VA. \na649c8-001: Osceola, donor's niece. His sister's daughter. She's about ten in this photo.\na649c8-007: Photo of Tonia Ann James (donor's daughter - she attended the digitization event with her father) from 1975. She's four in this photo.\na649c8-006: Jennifer (Jiji), donor's niece. His brother's daughter.\na649c8-004: Melvin, donor's nephew. Osceola's youngest sibling and only brother.\na649c8-003: Butch Essex, donor's cousin. They come visit Lakeland about every weekend. In the photo he's about 12. \na649c8-002: School photo of Steven (Butch's brother, one year younger than Butch). \na649c8-053: Donor's mother (Gladys Lillian Haliburton) sitting with granddaughter Osceola in a house.\na649c8-052: Donor in 1972 in Army in Germany. He was a cook; started out as a supply clerk. \na649c8-051: Family photo of (bottom row left to right) sister Louise, Louise's daughter Jennifer, Randolph Jr (Randy), Osceola,(top row left to right) donor's brother James Haliburton, donor's brother Vincent. Taken around 1974.\na649c8-049: Donor's cousin Shirley and Gladys in Virginia in September 1996. Gladys is 90 years old when this was taken.\na649c8-048: Donor's mother at a church function. \na649c8-045: Donor's aunt Lottie Essex, taken in the 50s. She lived to be 102.\na649c8-043: Sep 21 1968 - photo of donor's mother on bottom left surrounded by family. From left to right bottom row: Osceola sr. and jr., Moses jr. and his wife Eleanor, and the rest are unknown names.\na649c8-040 : Family photo in front of the Settlers(sp?) in Lakeland on Navahoe Street, across from where donor lived, in mid 70's. Pictured are Donor's mother, Carry, Moses, Boy, Osceola Sr. and Jr., and unknown on the far right. \na649c8-039: Photo of a young Julia May Pitts, a family friend. She's a Lakelander about 96 years old now. \na649c8-038: Moses, Eleanor, Deborah, Osceola Sr., donor's brother Zeke, and donor in late 60s. \na649c8-035: Taken Sep 1968 - Gladys, donor's father Moses Carry Haliburton.\na649c8-033: Sep 19 1968 - From Osceola's dedication at First Baptist Church.\na649c8-031: Left to right -Jennifer, Randolph, Osceola, and Gladys. Photo taken outside of home. Osceola was about 4 or 5. \na649c8-030: 1968 - Louise and her son Randy. Louise is married to donor's oldest brother, James.\na649c8-028: 1968 - Donor's father Moses, Louise, little Randy, and James.\na649c8-026: Sep 19 1968 - \"Osceola's dedication\" written on back. Osceola on a couch, surrounded by gifts.\na649c8-024: 1996 - Gladys, aged 90, sitting in couch and Shirley (?) in the kitchen in the back.\na649c8-023: Candid photo of Lowell in '75 or '76.\na649c8-022: February '56. Three kids standing in a road. Donor's Essex cousins, from Virginia. His \"mother's people.\" \na649c8-020: Sep 19 1968 - Osceola junior and senior on a couch. Likely from Osceola Jr's dedication.\na649c8-018: 1952 written on back - donor's brother Randolph (who was in Marine Corps)and his paternal grandmother, Fanny.\na649c8-017: Donor's mother, Randy, Jiji, Osceola Jr.\na649c8-016: Christmas photo - Timmy (Julia May Pitts's grandson), Osceola.\na649c8-014: Dec 1953. Fanny sitting by a tree. \na649c8-011: Elaine/Elaina Johnson. \na649c8-010: Melvin in front of a TV. He's about 6. Likely mid 70s.\na649c8-009: Osceola Sr. \na649c8-013: Gladys, donor's uncle Fred, donor's aunt Lottie.\na649c8-041: James Randolph Haliburton Jr. written on back. Donor's oldest brother - born nine years before donor, so born in 1931. Photo taken shortly after his birth. Other older brother Zeke was born in 1933.\na649c8-046: James, nicknamed Little Randy, and Jiji. \na649c8-059 & -060: Class photos of Osceola Jr - one in elementary/middle school, one in high school.\na649c8-063: Portrait of Mrs Stelma Lomax, next door neighbor and longtime resident of the community. This photo is likely from her 30s.\na649c8-065: Small photo of donor's brother Moses Jr. Some odd damage on photo.\na649c8-056: Little Melvin's graduation photo in 1991, graduating from Parkdale High.\na649c8-067: Small sepia portrait of Iris Potts - a longtime Lakeland resident, likely taken in 50s.\na649c8-064: Very old photo, circa early 1900s is of an unknown man wearing a hat. Likely some family member.\na649c8-069 & -070: A house on Lakeland Rd, taken before 70s.\na649c8-066: Small black and white portrait of Gladys, circa 50s.\na649c8-071: Sepia photo of Gladys's friend in a garden. \na649c8-057: 1977 school photo - Jiji, donor's niece.\na649c8-055: Graduation photo of (name not mentioned), in 1960s-80s.\na649c8-061: Large photo of Fanny, donor's grandmother. Sepia, with coloring added. From early 1900s.",
      "Sequence": 499,
      "Created": "2021-01-14T13:15:45.000Z",
      "ID": "LCHP--000499"
    },
    "createdTime": "2021-01-14T13:15:45.000Z"
  },
  {
    "id": "recou0LA6W1Gtmr4V",
    "fields": {
      "Donor": [
        "recSa8uT8dsCEQSpM"
      ],
      "Date of Donation": "2019-09-22",
      "Description": "Photo album of the Smith and Johnson Families, 1975 -1985. From Robert Smith and Maggie Johnson.\nPage 1:  His wife, Virginia C. Smith, is pictured making a cake in the top right photo. She is pictured again in the middle left with her dog. In the lower four photos is donor's youngest sister, Vanessa H. Smith.\nPage 2:  Left middle - Irene H. Smith born in Lakeland. This picture was taken in their Washington Home. On lowest left photo is donor's father, Robert Lee Smith. Middle right is donor's sister holding her dog. All pictures on this page taken in Washington home, around/during Christmas. Donor's parents eloped to DC, near U street in the 40s. \nPage 3: Middle left photo is donor's mother and sister. Top right is a Christmas tree. On top left is donor's mother, possibly with a young neighbor. All taken near Christmas 1975.\nPage 4: Donor's brother in middle left, on his graduation day from Howard in 1974. Top left - pictured with donor's cousin Raynard Johnson, Maggie's brother. All other pictures on that page from that day. They still lived in DC.\nPage 5: Left middle photo is donor's brother on his graduation day again. Middle right is donor's father. Bottom right is relatives from South Carolina visiting them in DC.\nPage 6: Bottom left is donor, bottom right is donor's brother, middle left is donor's sister. Top right is the DC house's porch. Top left is donor's brother and mother. They lived in the DC house all together for almost 30 years, and donor's mother lived their until her death in 2017.\nPage 7: More pictures of donor's sister and brother in the DC home. \nPage 8: Donor's father on the porch of DC home, as well as other various family members and friends. The dog appears again.\nPage 9: This whole page is pictures from donor's sister's prom - she graduated from McKinley Tech in DC in 1975. It was a college preparatory school, that many people sought to attend. Donor and his brother didn't attend their prom.\nPage 10: More pictures from sister's prom, including her date and dress.\nPage 11: Middle right is sister's ex boyfriend, her prom date.\nPage 12: Middle left is Lamatine Johnson, donor's oldest living cousin in Lakeland. Lamatine was honored by Pres. Clinton for the work he did with the youth in DC. This photo is from his second wedding in about the 70s. His mother, Leila is also pictured. This page is mainly photos from the wedding. Lamatine had five siblings, all from Lakeland. One didn't live through childhood.\nPage 13: More pictures from Lamatine's wedding. Donor's wife may have made the wedding cake - she had a cake business on the side.\nPage 14: Bottom left is donor's brother, Emmanual Smith, with his wife Ella on their wedding day. Middle left is their daughter, Adrienne (sp? Donor is unsure of spelling.) Rest of photos are from Christmas time.",
      "Sequence": 494,
      "Created": "2021-01-14T13:15:25.000Z",
      "ID": "LCHP--000494"
    },
    "createdTime": "2021-01-14T13:15:25.000Z"
  },
  {
    "id": "recq3CAdqDfxThc28",
    "fields": {
      "Donor": [
        "recsMlnugCWUv8T4j"
      ],
      "Date of Donation": "2019-09-21",
      "Description": "Photo 1: Donor's father, Isiash Johnson, during World War II in 1943.  \nPhotos 2 & 3: Lakeland boyscouts 1962-63, Mr. Pitts was leader at the time. Donor's brother in picture. Written on the back is the Donor's name.\nPhoto 4: Uncle Purcell. Circa 1940s? Written on the top is \"Brother Russell.\" Written on the side is \"Purcell Russell.\"\nPhotos 5 & 6: Donor and other children from a Sandy Point beach trip, March 1964. Written on the back of each is the donor's name.\nPhoto 6: Donor with her family (From left to right: Leo, Lamatine, Raynard, herself, and Isiash) on Navahoe street in 1958.\nPhoto 7: Professional portrait of Leo, Lamatine, Raynard, Isiash and in the center is the donor. Taken for a mothers day gift 1995.\nPhoto 8: Taken in Lakeland of Maggie and brothers Isaiah and Raynard, on back Leo and Lamatine. 1958-1962\nPhoto 9: Picture of Uncle Jerome Russell and brother Leo across from the train tracks, 1947.\nPhoto 10: Picture of father and brother at Sparrow's Beach, 1954. Most likely from a day trip.\nPhoto 11: Pictures of Lamatine, Leo and other kids from the neighborhood across the tracks in 1949. This was before donor moved to Navahoe street. Taken in someone's yard.\nPhoto 12: Three pictures of donor's birthday party. Georgie Smith in one picture, Taken in March 1968. Written on the back of each photo is '\"March 1968.\"\nPhoto 13: Neighbor's backyard; Donor's mother, donor, Isiash and Raynard, August 1965. Like many photos the donor has brought in, this photo is a group of family standing in their yard in Lakeland.\nPhoto 14: Miss Elizabeth and aunt Irene on eastern side of Lakeland in 1940s.\nPhoto 15: Raynard and other man in front of Macks house, 1966 or 67.\nPhoto 16: Kids hanging out in Lakeland, July 1957. \nPicture of donor and Isaiah looking down Navajo street, March 1958.\nPhoto 17: Donor and parents in their living room of house in Lakeland, 1957.\nPhoto 18: Donor in 1957.\nPhoto 19: Donor's grandmother Azora, Leo and other kids in front of Azora's house right across from Lakeland elementary, 1947 or '48.\nPhoto 20: Butch Dory and Maggie in car in 1965 or 66.\nPhoto 21: Donor's cousin Robert Smith, Emmanuel, Raynard, donor, Vanessa and Isaiah in front of house on Navahoe street and at the beach, March 1964.\nPhoto 22: Donor's grandfather, Mr. Charlie Russell, who first came to Lakeland in 1910s-1920s.\nPhoto 23: Donor's parents with brother Raynard in 1952.\n ",
      "Sequence": 513,
      "Created": "2021-01-14T13:17:14.000Z",
      "ID": "LCHP--000513"
    },
    "createdTime": "2021-01-14T13:17:14.000Z"
  },
  {
    "id": "recr4RuZDKiKgFzxS",
    "fields": {
      "Donor": [
        "recPwH8NqmQKvhyPB"
      ],
      "Date of Donation": "2020-01-03",
      "Sequence": 498,
      "Created": "2021-01-14T13:15:45.000Z",
      "ID": "LCHP--000498"
    },
    "createdTime": "2021-01-14T13:15:45.000Z"
  },
  {
    "id": "recslMOF4nGleknFk",
    "fields": {
      "Donor": [
        "recCZsOgGo3gUFsjv"
      ],
      "Date of Donation": "2019-09-22",
      "Description": "Funeral program for Mary E. Braxton (b. January 3, 1918 d. January 5, 2011) she was a resident of Lakeland. Photo on the cover of program is Ms. Braxton  near Lake Artemesia. \n\nA photograph of a Lakeland house on Pierce St. Taken early 1960s. Probably the home of Rosie Gross (Ms. Maxine's great grandmother). \n\nInterview transcript that Maxine Gross or Delphine Gross did of their grandmother (Agnes Gross) for a class in the 1980s. Agnes Gross' house was on the land of the College Park Community Center, but was taken bc of eminent domain. They then relocated to a property in on 54th Ave. Agnes Gross is the youngest of 14 siblings.\n\nProgress reports from Lakeland Elementary School, at the time Lakeland ES was segregated. Located on 54th  and Lakeland, right across the railroad tracks. The principal at the time of Ms. Gross K year was Edgar Smith. Smith was principal from about 1928 when school opened to about 1968. Smith not native of Lakeland. \n\nObituary from Lakelander, Alberta V. Terry. Mother of Agnrd out of The Star (newspaper). The funeral service held Embry AME Church.\n\nA ticket for a banquet for Agnes Gross held at Paint Branch ES, she was a long time member of Embry AME Church. She was a part of a missionary service. \n\nFuneral program of Agnes Gross AME (b. June 13, 1907 d. February 21, 1992). \n\nStamp savings book Elwood Harrison Gross c. 1930s. Children would be encouraged to purchase stamps from school to support the government, the children's version of war savings bonds. \n\nElwood Harrison Gross report card from 1946. According to Maxine Gross,  he was not the best scholar. He told stories of skipping school the first day. Teacher was B.R. Waters. \n\nReal Estate Sales Contract, perhaps for the property on 5011 Navahoe Street in 1944 for Mary Tabbs (had a daughter named Janie)\n\n",
      "Sequence": 509,
      "Created": "2021-01-14T13:16:54.000Z",
      "ID": "LCHP--000509"
    },
    "createdTime": "2021-01-14T13:16:54.000Z"
  },
  {
    "id": "recw1DGDaIHtMMWC6",
    "fields": {
      "Donor": [
        "reclni6UDaJajzksN"
      ],
      "Date of Donation": "2019-09-21",
      "Description": "Photographs of family birthdays, funerals, class pictures 1970s-2010\n\nPhoto 1 - Catherine Adams sitting in a chair. Taken in donor's mother's house in Cheverly on April 1978. She had 12 children.\nPhoto 2 - Flash photo of Helen Adams, donor's mother.\nPhoto 3 - Flash photo of Dennis \"Chang\" Adams, a member of the Chang Band for over 50 years.\nPhoto 4 - Helen Adams, taken in Thanksgiving 2004.\nPhoto 5 - Helen posing by a couch on donor's birthday in 2004. Taken in Helen's home.\nPhoto 6 - Photo taken at the hall in Culmore Manor for a birthday.\nPhoto 7 - Helen again, sitting on a couch with a young boy, one of the donor's young cousins.\nPhoto 8 - Rosa May, aka Baby Sis taken in Christmas 2003 in Baltimore.\nPhoto 9 - Jerald McNair, Chris Adams, Edwin McNair (also known as Bo), Carlton Gibson. All pictured at a party.\nPhoto 10 - Harold Adams in a suit. He was an architect, built the red house on 8112 51st Ave for his mother. Picture taken at funeral of Aunt Rosie.\nPhoto 11 - Nick Cager, Carl's brother. Also from the funeral.\nPhoto 12 - Catherine sitting in a chair.\nPhoto 13 - Harold again, also from the funeral.\nphoto 14 - Rosa again, and Wendy Hackney. \"Faith's Baby sis\" written on the back. \nPhoto 15 - Ann Adams gesturing, and Ricky Adams in the back. Another brithday party.\nPhoto 16 - Ricky Adams.\nPhoto 17 - Ann, Ricky, and Judy, Ricky's girlfriend.\nPhoto 18 - A polaroid - donor's grandmother's birthday party, her 60th birthday. L-r bottom row: Alice, Catherine, Rosa. L-r Top row: Ann and Helen Adams. Middle - Paullette.\nPhoto 19 - Aunt Rosa's children, Carlton and Crystal. Cheryl as well. All are Gibsons.\nPhoto 20 - Donor's sister Zaina Claiborne posing in a blue suit.\nPhoto 21 - Eric Brown.\nPhoto 22 - Ebony Jackson's graduation photo in '96. Ebony is donor's daughter.\nPhoto 23 - American Legion 275 in Glen Arden. Donor was the chaplain for it for over 20 years. Here she is pictured with the Commander Johnny Evans, the first black commander.\nPhoto 24 - Taken at American Legion in Glen Arden in Christmas 2010.\nPhoto 25 - Naomi at her first birthday, March 2009, Ebony's daughter. Pictured with Tatiana, her sister.\nPhoto 26 - Donor pictured at the Dogg Pound, at the Stadium Armory. A motorcycle club - always had parties around donor's birthday, so she went by.\nPhoto 27 - Donor's brothers Chris and Leo taken at a cookout.\nPhoto 28 - Group photo at the \"Flaming Nights\" party. Amanda Smith, Kenny Fats, donor, Chris.",
      "Sequence": 529,
      "Created": "2021-01-14T13:17:32.000Z",
      "ID": "LCHP--000529"
    },
    "createdTime": "2021-01-14T13:17:32.000Z"
  },
  {
    "id": "recw73ojY0CcotAH0",
    "fields": {
      "Donor": [
        "recbUbGOqlZ5iJjlI"
      ],
      "Date of Donation": "2019-09-21",
      "Description": "Photo 1: Picture of Gasson Bradford Jr., estimated to be taken in \n late 50s, near Lakeland Elementary School. \nPhoto 2: Nathaniel Tolson, estimated circa late 50s. Likely taken on a vacation. \nPhoto 3: Alvin Seldon Jr., at the home of the donor. \nPhoto 4: Alvin Seldon Jr., Sharon Seldon, Karon Seldon, Denise Seldon, in Lanham MD (late 70s). \nPhoto 5: Aberta Tolson (donor's grandmother), Karon Seldon, Sharon Seldon, Denise Seldon, Alvin Seldon, Pamela Tolson, Eugene Jackson. Photograph taken in kitchen.\nPhoto 6: Gasson Bradford Sr., Gasson Bradford Jr., Geraldine Jackson, 70s or early 80s.\nPhoto 7: Tom Thumb wedding in the early 50s. Donor participated in it. Pictured is Alvin Seldon, etc. Couldn't catch other names. \n",
      "Sequence": 524,
      "Created": "2021-01-14T13:17:26.000Z",
      "ID": "LCHP--000524"
    },
    "createdTime": "2021-01-14T13:17:26.000Z"
  },
  {
    "id": "recx0H2YVDeu02K2L",
    "fields": {
      "Donor": [
        "recPwH8NqmQKvhyPB"
      ],
      "Date of Donation": "2019-08-16",
      "Sequence": 510,
      "Created": "2021-01-14T13:17:07.000Z",
      "ID": "LCHP--000510"
    },
    "createdTime": "2021-01-14T13:17:07.000Z"
  },
  {
    "id": "recx3dDdjL5rd1Ngt",
    "fields": {
      "Donor": [
        "recPwH8NqmQKvhyPB"
      ],
      "Date of Donation": "2019-09-07",
      "Description": "Announcement for the graduation class of 1950 Lakeland high School\n2 different newsletters entitled \"The Lakelander,\" October 1996 has an image of Lakeland High School on the front.\n1950 Graduation Stationary.\nMeeting minutes from December 1979.\n",
      "Sequence": 519,
      "Created": "2021-01-14T13:17:21.000Z",
      "ID": "LCHP--000519"
    },
    "createdTime": "2021-01-14T13:17:21.000Z"
  }
]